In [1]:
import pandas as pd
import numpy as numpy

In [3]:
df_fulfilment = pd.read_csv('fulfilment_center_info.csv')
df_fulfilment.head(3)

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0

In [6]:
df_meal = pd.read_csv('meal_info.csv')
df_meal.sample(3)

    meal_id   category cuisine
5      1311     Extras    Thai
3      1248  Beverages  Indian
37     1247    Biryani  Indian

In [7]:
df_sample=pd.read_csv('sample_submission.csv')
df_sample.head(3)

        id  num_orders
0  1028232           0
1  1127204           0
2  1212707           0

In [12]:
df_train = pd.read_csv('train.csv')
df_train.head(3)

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189

In [13]:
df_test = pd.read_csv('test.csv')
df_test.head(3)

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,1028232,146,55,1885,158.11,159.11,0,0
1,1127204,146,55,1993,160.11,159.11,0,0
2,1212707,146,55,2539,157.14,159.14,0,0

In [9]:
df_meal = pd.read_csv('meal_info.csv')
df_meal.head(3)

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai

In [15]:
print(df_test.shape)
print(df_train.shape)
print(df_sample.shape)
print(df_fulfilment.shape)
print(df_meal.shape)

(32573, 8)
(456548, 9)
(32573, 2)
(77, 5)
(51, 3)